<?php
// +----------------------------------------------------------------------
// | Thinkphp框架[基于ThinkPHP5.1开发]
// +----------------------------------------------------------------------
// | Copyright (c) 2018-2022 http://www.mylucas.com.cn
// +----------------------------------------------------------------------
// | ThinkPHP框架永久免费开源
// +----------------------------------------------------------------------
// | Author: Lucas <598936602@qq.com>
// +----------------------------------------------------------------------

namespace app\system\model;

use think\Model;

/**
 * 后台菜单语言模型
 * @package app\system\model
 */
class SystemMenuLang extends Model
{
    // 自动写入时间戳
    protected $autoWriteTimestamp = false;
}
